wrk6/wrk_2003_r_10min_Heavy.txt
wrk -t 3 -c 3 -d600 -R 50 -math 0 --latency http://13.0.0.29:8081/high/web350m.html
Running 10m test @ http://13.0.0.29:8081/high/web350m.html
  1 threads and 1 connections
  Thread calibration: mean lat.: 5806.080ms, rate sampling interval: 11616ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.05m     2.82m    9.85m    59.70%
    Req/Sec     0.00      0.00     0.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    304611.33 ms
 75.000%    444858.37 ms
 90.000%    536084.48 ms
 99.000%    583532.54 ms
 99.900%    591396.86 ms
 99.990%    591396.86 ms
 99.999%    591396.86 ms
100.000%    591396.86 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   13484.031     0.000000            1         1.00
   61997.055     0.100000            7         1.11
  135659.519     0.200000           14         1.25
  191627.263     0.300000           21         1.43
  242745.343     0.400000           27         1.67
  304611.327     0.500000           34         2.00
  330563.583     0.550000           37         2.22
  359137.279     0.600000           41         2.50
  380895.231     0.650000           44         2.86
  414711.807     0.700000           47         3.33
  451411.967     0.750000           51         4.00
  458751.999     0.775000           52         4.44
  473956.351     0.800000           54         5.00
  494665.727     0.825000           56         5.71
  506462.207     0.850000           57         6.67
  526385.151     0.875000           59         8.00
  536084.479     0.887500           60         8.89
  543686.655     0.900000           61        10.00
  550502.399     0.912500           62        11.43
  550502.399     0.925000           62        13.33
  556793.855     0.937500           63        16.00
  569376.767     0.943750           64        17.78
  569376.767     0.950000           64        20.00
  576192.511     0.956250           65        22.86
  576192.511     0.962500           65        26.67
  576192.511     0.968750           65        32.00
  583532.543     0.971875           66        35.56
  583532.543     0.975000           66        40.00
  583532.543     0.978125           66        45.71
  583532.543     0.981250           66        53.33
  583532.543     0.984375           66        64.00
  591396.863     0.985938           67        71.11
  591396.863     1.000000           67          inf
#[Mean    =   303239.168, StdDeviation   =   169409.439]
#[Max     =   590872.576, Total count    =           67]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%    5398.53 ms
 75.000%    8749.06 ms
 90.000%    10289.15 ms
 99.000%    12042.24 ms
 99.900%    13025.28 ms
 99.990%    13025.28 ms
 99.999%    13025.28 ms
100.000%    13025.28 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    5005.311     0.000000            1         1.00
    5128.191     0.100000            7         1.11
    5197.823     0.200000           14         1.25
    5226.495     0.300000           21         1.43
    5279.743     0.400000           29         1.67
    5398.527     0.500000           34         2.00
    5435.391     0.550000           37         2.22
    6660.095     0.600000           41         2.50
    6815.743     0.650000           44         2.86
    7639.039     0.700000           47         3.33
    8970.239     0.750000           51         4.00
    9003.007     0.775000           52         4.44
    9093.119     0.800000           54         5.00
    9314.303     0.825000           56         5.71
    9363.455     0.850000           57         6.67
   10248.191     0.875000           59         8.00
   10289.151     0.887500           60         8.89
   10379.263     0.900000           61        10.00
   10403.839     0.912500           62        11.43
   10403.839     0.925000           62        13.33
   10436.607     0.937500           63        16.00
   10657.791     0.943750           64        17.78
   10657.791     0.950000           64        20.00
   11386.879     0.956250           65        22.86
   11386.879     0.962500           65        26.67
   11386.879     0.968750           65        32.00
   12042.239     0.971875           66        35.56
   12042.239     0.975000           66        40.00
   12042.239     0.978125           66        45.71
   12042.239     0.981250           66        53.33
   12042.239     0.984375           66        64.00
   13025.279     0.985938           67        71.11
   13025.279     1.000000           67          inf
#[Mean    =     6847.167, StdDeviation   =     2170.947]
#[Max     =    13017.088, Total count    =           67]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  69 requests in 10.03m, 23.58GB read
  Socket errors: connect 0, read 0, write 0, timeout 199
Requests/sec:      0.11
Transfer/sec:     40.12MB
Running 10m test @ http://13.0.0.29:8081/high/web350m.html
  1 threads and 1 connections
  Thread calibration: mean lat.: 5441.536ms, rate sampling interval: 10887ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.08m     2.86m    9.94m    57.35%
    Req/Sec     0.00      0.00     0.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    299892.73 ms
 75.000%    455344.13 ms
 90.000%    542113.79 ms
 99.000%    590348.29 ms
 99.900%    596639.74 ms
 99.990%    596639.74 ms
 99.999%    596639.74 ms
100.000%    596639.74 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   12918.783     0.000000            1         1.00
   70713.343     0.100000            7         1.11
  131465.215     0.200000           14         1.25
  185466.879     0.300000           21         1.43
  239992.831     0.400000           28         1.67
  299892.735     0.500000           34         2.00
  331874.303     0.550000           38         2.22
  360710.143     0.600000           41         2.50
  394264.575     0.650000           45         2.86
  425983.999     0.700000           48         3.33
  455344.127     0.750000           51         4.00
  470024.191     0.775000           53         4.44
  484179.967     0.800000           55         5.00
  498073.599     0.825000           57         5.71
  505675.775     0.850000           58         6.67
  534773.759     0.875000           60         8.00
  542113.791     0.887500           61         8.89
  548929.535     0.900000           62        10.00
  555220.991     0.912500           63        11.43
  555220.991     0.925000           63        13.33
  563085.311     0.937500           64        16.00
  569376.767     0.943750           65        17.78
  569376.767     0.950000           65        20.00
  577241.087     0.956250           66        22.86
  577241.087     0.962500           66        26.67
  577241.087     0.968750           66        32.00
  590348.287     0.971875           67        35.56
  590348.287     0.975000           67        40.00
  590348.287     0.978125           67        45.71
  590348.287     0.981250           67        53.33
  590348.287     0.984375           67        64.00
  596639.743     0.985938           68        71.11
  596639.743     1.000000           68          inf
#[Mean    =   304654.758, StdDeviation   =   171775.645]
#[Max     =   596115.456, Total count    =           68]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%    5410.81 ms
 75.000%    7376.90 ms
 90.000%    11403.26 ms
 99.000%    13238.27 ms
 99.900%    15155.20 ms
 99.990%    15155.20 ms
 99.999%    15155.20 ms
100.000%    15155.20 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    5074.943     0.000000            1         1.00
    5144.575     0.100000            7         1.11
    5181.439     0.200000           16         1.25
    5230.591     0.300000           21         1.43
    5345.279     0.400000           29         1.67
    5410.815     0.500000           34         2.00
    5480.447     0.550000           38         2.22
    5828.607     0.600000           41         2.50
    6307.839     0.650000           45         2.86
    6922.239     0.700000           48         3.33
    7376.895     0.750000           51         4.00
    7917.567     0.775000           53         4.44
    8187.903     0.800000           55         5.00
    9142.271     0.825000           57         5.71
   10313.727     0.850000           58         6.67
   10862.591     0.875000           60         8.00
   11403.263     0.887500           61         8.89
   11640.831     0.900000           62        10.00
   11747.327     0.912500           63        11.43
   11747.327     0.925000           63        13.33
   12214.271     0.937500           65        16.00
   12214.271     0.943750           65        17.78
   12214.271     0.950000           65        20.00
   12886.015     0.956250           66        22.86
   12886.015     0.962500           66        26.67
   12886.015     0.968750           66        32.00
   13238.271     0.971875           67        35.56
   13238.271     0.975000           67        40.00
   13238.271     0.978125           67        45.71
   13238.271     0.981250           67        53.33
   13238.271     0.984375           67        64.00
   15155.199     0.985938           68        71.11
   15155.199     1.000000           68          inf
#[Mean    =     6842.398, StdDeviation   =     2522.914]
#[Max     =    15147.008, Total count    =           68]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  69 requests in 10.02m, 23.73GB read
  Socket errors: connect 0, read 0, write 0, timeout 199
Requests/sec:      0.11
Transfer/sec:     40.41MB
Running 10m test @ http://13.0.0.29:8081/high/web350m.html
  1 threads and 1 connections
  Thread calibration: mean lat.: 5847.040ms, rate sampling interval: 11698ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.20m     2.80m    9.93m    59.09%
    Req/Sec     0.00      0.00     0.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    314048.51 ms
 75.000%    454557.70 ms
 90.000%    538443.78 ms
 99.000%    583532.54 ms
 99.900%    596115.45 ms
 99.990%    596115.45 ms
 99.999%    596115.45 ms
100.000%    596115.45 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   13443.071     0.000000            1         1.00
   75104.255     0.100000            7         1.11
  141033.471     0.200000           14         1.25
  189005.823     0.300000           20         1.43
  263192.575     0.400000           27         1.67
  314048.511     0.500000           33         2.00
  349437.951     0.550000           37         2.22
  370409.471     0.600000           40         2.50
  398458.879     0.650000           43         2.86
  427556.863     0.700000           47         3.33
  454557.695     0.750000           50         4.00
  468713.471     0.775000           52         4.44
  477888.511     0.800000           53         5.00
  500432.895     0.825000           55         5.71
  523239.423     0.850000           57         6.67
  530841.599     0.875000           58         8.00
  538443.775     0.887500           59         8.89
  546308.095     0.900000           60        10.00
  554172.415     0.912500           61        11.43
  562561.023     0.925000           62        13.33
  562561.023     0.937500           62        16.00
  568852.479     0.943750           63        17.78
  568852.479     0.950000           63        20.00
  576192.511     0.956250           64        22.86
  576192.511     0.962500           64        26.67
  576192.511     0.968750           64        32.00
  583532.543     0.971875           65        35.56
  583532.543     0.975000           65        40.00
  583532.543     0.978125           65        45.71
  583532.543     0.981250           65        53.33
  583532.543     0.984375           65        64.00
  596115.455     0.985938           66        71.11
  596115.455     1.000000           66          inf
#[Mean    =   312211.208, StdDeviation   =   168104.327]
#[Max     =   595591.168, Total count    =           66]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%    5390.34 ms
 75.000%    7757.82 ms
 90.000%    11378.69 ms
 99.000%    15941.63 ms
 99.900%    16351.23 ms
 99.990%    16351.23 ms
 99.999%    16351.23 ms
100.000%    16351.23 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    5083.135     0.000000            1         1.00
    5132.287     0.100000            7         1.11
    5193.727     0.200000           14         1.25
    5259.263     0.300000           20         1.43
    5320.703     0.400000           27         1.67
    5390.335     0.500000           33         2.00
    5500.927     0.550000           37         2.22
    5869.567     0.600000           40         2.50
    6365.183     0.650000           43         2.86
    7077.887     0.700000           47         3.33
    7757.823     0.750000           50         4.00
    7946.239     0.775000           52         4.44
    8503.295     0.800000           53         5.00
   10305.535     0.825000           55         5.71
   10452.991     0.850000           57         6.67
   10698.751     0.875000           58         8.00
   11378.687     0.887500           59         8.89
   12451.839     0.900000           60        10.00
   12722.175     0.912500           61        11.43
   13664.255     0.925000           62        13.33
   13664.255     0.937500           62        16.00
   13688.831     0.943750           63        17.78
   13688.831     0.950000           63        20.00
   14196.735     0.956250           64        22.86
   14196.735     0.962500           64        26.67
   14196.735     0.968750           64        32.00
   15941.631     0.971875           65        35.56
   15941.631     0.975000           65        40.00
   15941.631     0.978125           65        45.71
   15941.631     0.981250           65        53.33
   15941.631     0.984375           65        64.00
   16351.231     0.985938           66        71.11
   16351.231     1.000000           66          inf
#[Mean    =     7056.353, StdDeviation   =     2930.350]
#[Max     =    16343.040, Total count    =           66]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  67 requests in 10.03m, 23.04GB read
  Socket errors: connect 0, read 0, write 0, timeout 198
Requests/sec:      0.11
Transfer/sec:     39.21MB